[
  {
    "id": 1,
    "title": "9 hairstyles for every holiday mood ",
    "image": "/ui/hero.jpg",
    "date": "September 12, 2023",
    "author": "Jayesha Khan",
    "tag": "Hair",
    "excerpt": "<p>Life is all about balance. <em>Sweatpants</em> on the bottom and great hair on top, a healthy meal and a sweet treat after, or a sweaty home workout sesh followed by a lazy day, it’s all about finding the right balance to help maintain a sense of normalcy this holiday season. That goes for holiday looks too—this holiday season, the theme is cute but comfy, finding looks to carry you all the way through from movie-marathons to spontaneous holiday Zoom parties.</p><p>This year’s holidays look a little (read: a lot different). While it has been a year of ups and downs and unpredictability, if you’re like us, you’ve been through every mood in the book. There may not be large holiday parties to get glammed up for, but you <em>can</em> still play with your look to suit your different moods this holi-stay season.</p><p><br></p><h2>1. When you feel like dressing up on the couch</h2><p>Sport to dress up and go to the only place we want to go this holiday season—the couch. Whether you are hitting the couch for a wine-filled holiday Zoom hang, a holiday movie marathon, or for some R&amp;R after a day of baking cookies, your soft&nbsp;waves will have you feeling fun, flirty, and fierce.&nbsp;</p><p>We love iconic blogger Sasha Exeter's loose waves with a classic middle part and&nbsp;Olivia's&nbsp;crochet&nbsp;headband to tie&nbsp;the look together.&nbsp;</p><p><strong>Tip: </strong>Use&nbsp;the to achieve any&nbsp;the perfect loose wave.</p><p><br></p><h2>2. When you’re over it</h2><p>Nothing says “over it but loving it” quite like piling all of your hair on the top of your head in a massive bun.</p><p>What do you do when you reach the point where you’re just over it all? Throw your hair up in a bun.  can be as sleek, chic, or messy — as low or high maintenance as you want.&nbsp;</p><p>Throwing your hair up in a bun is the perfect solution for when you have second-day hair or your locks just aren’t doing what you want them to do. Truthfully buns are the ideal #wfh or #hfh (holiday from home) look because they help you keep your hair out of your face and require minimal time and effort.</p><p><strong>Tip: </strong>Elevate your bun with a hair accessory like a, or.</p><p><br></p><h2>3. When you're feeling the love</h2><h3>Romantic updo with side braid</h3><p>Did your significant other just surprise you with the news that they are bringing home fancy takeout or ingredients for a delicious home cooked meal? Sounds like you have a date night you didn’t quite prepare for. The good thing is that, with an updo, you can worry less about your hair and spend more time looking forward to the spontaneous treat.</p><p>Updos are pretty and elegant, but they can also be casual or edgy—it all depends how you accessorize and complete the look. The best part about  is that they look great and can be done in no time at all.&nbsp;</p><p><strong>Tip: </strong>Add a braid down the side&nbsp;or&nbsp;finish off the look with a sultry hair accessory for late night fun with your SO.&nbsp;</p><p><br></p><h2>4.&nbsp;When you just want to watch The Grinch in Christmas pajamas</h2><p>Is there anything better than snuggling up on the couch with a cozy blanket while the snow falls silently outside? We didn't think so.&nbsp;Nothing says Christmas spirit quite&nbsp;,  and candy canes—complete with a couple of cute pigtails, of course.&nbsp;</p><p>We love the look of these long sleek pigtails, using two clip-in to add instant length volume.</p><p><strong>Tip</strong>: Elevate your pigtails by styling the two pieces; braid them, add different sections...get creative! </p>"
  },
  {
    "id": 2,
    "title": "The Only and most Ultimate Guide to Skincare Routines",
    "image": "/skincare.jpg",
    "date": "October 2, 2023",
    "author": "Numa Sharma",
    "tag": "Skincare",
    "excerpt": "Discover the best skincare routines for every skin type. From cleansing to moisturizing, learn how to keep your skin glowing all year round."
  },
  {
    "id": 3,
    "title": "Bridal Makeup Trends 2025",
    "image": "/bridal/bridal (1).jpg",
    "date": "November 14, 2025",
    "author": "Sarita Shah",
    "tag": "Makeup",
    "excerpt": "<h1><strong>Bridal Makeup Trends 2025</strong></h1><hr /><h3><strong>1. ✨ <em>Minimal Glass-Skin Look</em></strong></h3><ul><li>Fresh, glowing, healthy skin finishes are trending.</li><li>Skin tints and lightweight foundations are popular.</li><li>Soft liquid highlighters add glow without greasiness.</li></ul><hr /><h3><strong>2. 💄 <em>Soft Nude & Peachy Tones</em></strong></h3><ul><li>Perfect for brides seeking subtle elegance.</li><li>Beautiful with pastel outfits and floral jewellery.</li></ul><hr /><h3><strong>3. 👁️ <em>Brown Smokey Eyes</em></strong></h3><ul><li>Softer and more romantic than black smokey eyes.</li><li>Ideal for evening functions like sangeet.</li></ul><hr /><h3><strong>4. 💫 <em>Feathered, Natural Brows</em></strong></h3><ul><li>Full, soft brows are in.</li><li>Soap brows and brow gels give a natural lift.</li></ul><hr /><h3><strong>5. 💋 <em>Bold Statement Lips</em></strong></h3><ul><li>Plum, wine, and berry shades dominate.</li><li>Velvet-matte finishes give a luxe look without dryness.</li></ul><hr /><h3><strong>6. 🌸 <em>Pastel Eye Makeup</em></strong></h3><ul><li>Pinks, lilacs, and peaches for soft daytime looks.</li><li>Great for haldi and mehendi.</li></ul><hr /><h3><strong>7. 🪷 <em>Soft Shimmer & Foiled Eyes</em></strong></h3><ul><li>Champagne and rose-gold metallics are trending.</li><li>Perfect for night functions.</li></ul><hr /><h3><strong>8. 🌙 <em>Underpainting / Soft Sculpting</em></strong></h3><ul><li>Blush and contour applied before foundation.</li><li>Gives natural dimension without heaviness.</li></ul><hr /><h3><strong>9. 💎 <em>Pearl, Stone & Crystal Accents</em></strong></h3><ul><li>Perfect for Insta-worthy bridal looks.</li><li>Great for mehendi and sangeet events.</li></ul><hr /><h3><strong>10. 💖 <em>Monochromatic Makeup Look</em></strong></h3><ul><li>Using one color across eyes, cheeks, and lips.</li><li>Shades like rose, coral, and mauve are popular.</li></ul>"
  },
 {
  "id": 4,
  "title": "How to Choose the Right Haircut",
  "image": "/haircut.jpg",
  "date": "November 14, 2025",
  "author": "Priya Shah",
  "tag": "Hair",
  "excerpt": "Choosing the right haircut can transform your look. Here are tips to find the perfect style for your face shape.",
  "content": "How to Choose the Right Haircut – Step-by-Step Guide\n\n1. Identify Your Face Shape\nCheck whether your face is oval, round, square, heart, or long.\nEach shape suits different styles — for example, layers for round faces, soft waves for square faces, and bobs for oval faces.\n\n2. Understand Your Hair Texture\nKnow whether your hair is straight, wavy, curly, or coily.\nSome cuts work best on certain textures — e.g., blunt cuts for straight hair, layers for wavy/curly hair.\n\n3. Check Your Hair Density (Thickness)\nDetermine if your hair is thin, medium, or thick.\nThin hair needs volume-adding cuts; thick hair benefits from structured or layered cuts.\n\n4. Consider Your Lifestyle\nPick a style that matches your daily routine.\nIf you have a busy schedule, choose low-maintenance cuts; if you enjoy styling, layered or textured cuts work well.\n\n5. Think About Your Maintenance Level\nSome cuts require regular trims (like bobs or bangs).\nDecide how often you're willing to visit the salon.\n\n6. Choose a Cut That Matches Your Personal Style\nClassic, modern, bold, elegant — select a haircut that reflects your personality.\nShort pixies for bold looks, soft waves for feminine styles, sleek bobs for professional appeal.\n\n7. Consider Your Hair Goals\nAre you trying to grow your hair, add volume, or reduce weight?\nDifferent cuts help achieve different goals — e.g., long layers help growing hair look stylish.\n\n8. Discuss With a Professional Stylist\nShare your face shape, hair issues, and expectations.\nA stylist can suggest what truly suits you based on professional judgment.\n\n9. Try Virtual Haircut Tools (Optional)\nApps allow you to preview styles on your photo.\nHelps reduce confusion and boosts confidence before cutting.\n\n10. Start With a Safe Version (If Unsure)\nIf you’re nervous, choose a softer or slightly longer version of the style.\nYou can always cut more later, but you cannot undo overcuts."
}

  {
    "id": 5,
    "title": "Waxing vs. Shaving: Pros and Cons",
    "image": "/waxing.webp",
    "date": "November 12, 2025",
    "author": "Priya Shah",
    "tag": "Skincare",
    "excerpt": "<p>The choice between these two hair removal methods is driven by the desired balance between convenience, cost, and the duration of results.</p><h3>Waxing</h3><ul><li><strong>Longevity of Results:</strong> <strong>Extended Smoothness</strong> (3-6 weeks) due to hair removal from the root.</li><li><strong>Hair Regrowth:</strong> <strong>Finer and Sparser</strong> over time as the follicle is potentially weakened.</li><li><strong>Skin Impact:</strong> <strong>Exfoliation Benefit</strong> (removes dead skin cells), but high risk of <strong>temporary pain and redness/inflammation.</strong></li><li><strong>Convenience:</strong> <strong>Low frequency</strong> of maintenance required, but mandates a <strong>regrowth period</strong> before treatment.</li><li><strong>Cost:</strong> <strong>Higher</strong> initial and recurring expense (especially for professional services).</li></ul><h3>Shaving</h3><ul><li><strong>Longevity of Results:</strong> <strong>Very Short-Term</strong> (1-3 days) as hair is only cut at the surface.</li><li><strong>Hair Regrowth:</strong> <strong>Coarser</strong> and more noticeable stubble due to the blunt cut.</li><li><strong>Skin Impact:</strong> <strong>Painless</strong> procedure, but high risk of <strong>nicks, cuts, razor burn,</strong> and chronic irritation.</li><li><strong>Convenience:</strong> <strong>High accessibility</strong> and <strong>quick integration</strong> into daily routines, but requires <strong>very high frequency</strong> of maintenance.</li><li><strong>Cost:</strong> <strong>Low</strong> initial and recurring expense.</li></ul><p><br></p>"
  },
  {
    "id": 6,
    "title": "Top 5 Facial Treatments for Glowing Skin",
    "image": "/facial.webp",
    "date": "October 25, 2023",
    "author": "Neha Gupta",
    "tag": "Facial",
    "excerpt": "Facials can rejuvenate your skin. Here are the top 5 treatments you should try for a radiant complexion."
  },
{
  "id": 7,
  "title": "The Art of Everyday Makeup",
  "image": "/makeup.jpg",
  "date": "November 14, 2025",
  "author": "Priyanka Shah",
  "tag": "Makeup",
  "excerpt": "Master the basics of everyday makeup with these simple tips and tricks for a flawless look.",
  "content": "<h1><strong>The Areas of Everyday Makeup – Detailed Points</strong></h1><hr /><h3><strong>1. Base Makeup (Foundation Area)</strong></h3><ul><li><p>Creates an even skin tone for a clean everyday look.</p></li><li><p>Includes primer, BB/CC cream, or lightweight foundation.</p></li><li><p>Helps smooth texture, blur pores, and prepare skin for other products.</p></li></ul><hr /><h3><strong>2. Concealer Area (Under-Eyes & Spots)</strong></h3><ul><li><p>Applied under the eyes to reduce dark circles and tiredness.</p></li><li><p>Used on blemishes, acne marks, and pigmentation for a natural finish.</p></li><li><p>Brightens the center of the face for a fresh appearance.</p></li></ul><hr /><h3><strong>3. Eyebrows Area</strong></h3><ul><li><p>Light filling or shaping gives structure to the face.</p></li><li><p>Soft brow pencil or brow gel keeps the look natural.</p></li><li><p>Defines facial expressions without looking heavy.</p></li></ul><hr /><h3><strong>4. Eye Makeup Area (Lids & Lash Line)</strong></h3><ul><li><p>Everyday look usually includes neutral eyeshadow or no eyeshadow at all.</p></li><li><p>A thin liner enhances eye shape without making it dramatic.</p></li><li><p>Mascara opens up the eyes and adds definition.</p></li></ul><hr /><h3><strong>5. Cheeks Area (Blush & Light Contour)</strong></h3><ul><li><p>Blush adds natural color and freshness to the face.</p></li><li><p>Soft contour or bronzer offers subtle dimension.</p></li><li><p>Cream or powder based on skin type.</p></li></ul><hr /><h3><strong>6. Lips Area</strong></h3><ul><li><p>Tinted lip balm, nude lipstick, or gloss keeps lips hydrated and fresh.</p></li><li><p>Neutral tones match everyday outfits and work environments.</p></li><li><p>Adds balance to the overall makeup look.</p></li></ul><hr /><h3><strong>7. Highlight Area (High Points of the Face)</strong></h3><ul><li><p>Applied to cheekbones, brow bones, and nose bridge.</p></li><li><p>Gives a soft glow without looking too shiny.</p></li><li><p>Ideal for fresh, natural everyday radiance.</p></li></ul><hr /><h3><strong>8. Setting Area (Powder or Spray)</strong></h3><ul><li><p>Light setting powder helps control oil in the T-zone.</p></li><li><p>Setting spray locks the makeup for long hours.</p></li><li><p>Keeps everyday makeup consistent throughout the day.</p></li></ul><hr /><h3><strong>9. Skincare Prep Area (Before Makeup)</strong></h3><ul><li><p>Cleanser, moisturizer, and sunscreen are essential.</p></li><li><p>Prepares skin so makeup applies smoothly and lasts longer.</p></li><li><p>Creates a healthy base that boosts the final makeup look.</p></li></ul>"
}

  {
    "id": 8,
    "title": "Bridal Hairstyles to Try This Year",
    "image": "/bridal/bridal (2).jpg",
    "date": "November 5, 2023",
    "author": "Jayesha Khan",
    "tag": "Bridal",
    "excerpt": "From classic buns to modern waves, check out the most popular bridal hairstyles for 2023."
  },
  {
    "id": 9,
    "title": "How to Maintain Colored Hair",
    "image": "/hair.jpeg",
    "date": "November 10, 2023",
    "author": "Numa Sharma",
    "tag": "Hair",
    "excerpt": "Colored hair needs special care. Learn how to keep your color vibrant and hair healthy."
  },
  {
    "id": 10,
    "title": "The Benefits of Regular Facials",
    "image": "/facial.webp",
    "date": "November 15, 2023",
    "author": "Aarti Patel",
    "tag": "Facial",
    "excerpt": "Regular facials can do wonders for your skin. Find out why you should make them a part of your routine."
  },
  {
    "id": 11,
    "title": "Makeup for Sensitive Skin",
    "image": "/makeup.jpg",
    "date": "November 20, 2023",
    "author": "Simran Kaur",
    "tag": "Makeup",
    "excerpt": "Sensitive skin? Here are the best makeup products and techniques to avoid irritation."
  },
  {
    "id": 12,
    "title": "Pre-Bridal Skincare Checklist",
    "image": "/bridal/bridal (3).jpg",
    "date": "November 25, 2023",
    "author": "Neha Gupta",
    "tag": "Bridal",
    "excerpt": "Get your skin wedding-ready with this essential pre-bridal skincare checklist."
  },
  {
    "id": 13,
    "title": "How to Get the Perfect Eyebrows",
    "image": "/ui/hero.jpg",
    "date": "December 1, 2023",
    "author": "Riya Mehra",
    "tag": "Skincare",
    "excerpt": "Eyebrows frame your face. Learn how to shape and maintain them perfectly."
  },
  {
    "id": 14,
    "title": "Best Hairstyles for Short Hair",
    "image": "/haircut.jpg",
    "date": "December 5, 2023",
    "author": "Sana Sheikh",
    "tag": "Hair",
    "excerpt": "Short hair, don’t care! Here are the best hairstyles to try if you have short hair."
  },
  {
    "id": 15,
    "title": "Natural Remedies for Glowing Skin",
    "image": "/skincare.jpg",
    "date": "December 10, 2023",
    "author": "Jayesha Khan",
    "tag": "Skincare",
    "excerpt": "Try these natural remedies to achieve glowing, healthy skin without harsh chemicals."
  },
  {
    "id": 16,
    "title": "Bridal Entry Ideas for 2023",
    "image": "/bridal/bridal (1).jpg",
    "date": "December 15, 2023",
    "author": "Numa Sharma",
    "tag": "Bridal",
    "excerpt": "Make your wedding entry unforgettable with these creative bridal entry ideas."
  },
  {
    "id": 17,
    "title": "How to Prevent Hair Fall",
    "image": "/hair.jpeg",
    "date": "December 20, 2023",
    "author": "Aarti Patel",
    "tag": "Hair",
    "excerpt": "Hair fall can be stressful. Here’s how to prevent it and keep your hair strong."
  },
  {
    "id": 18,
    "title": "Quick Makeup Hacks for Busy Mornings",
    "image": "/makeup.jpg",
    "date": "December 25, 2023",
    "author": "Simran Kaur",
    "tag": "Makeup",
    "excerpt": "Short on time? Try these quick makeup hacks to look your best in minutes."
  },
  {
    "id": 19,
    "title": "The Science Behind Facials",
    "image": "/facial.webp",
    "date": "December 28, 2023",
    "author": "Neha Gupta",
    "tag": "Facial",
    "excerpt": "Ever wondered how facials work? We explain the science behind your favorite treatments."
  },
  {
    "id": 20,
    "title": "Bridal Lehenga Trends",
    "image": "/bridal/bridal (2).jpg",
    "date": "December 30, 2023",
    "author": "Riya Mehra",
    "tag": "Bridal",
    "excerpt": "From pastels to bold reds, discover the latest bridal lehenga trends for the season."
  }
]
